# Python3 条件控制
# Python 条件语句是通过一条或多条语句的执行结果（True 或者 False）来决定执行的代码块
# 一个简单的 if 实例
var1 = 100
if var1:
    print("1 - if 表达式条件为 true")
    print(var1)

var2 = 0
if var2:
    print("2 - if 表达式条件为 true")
    print(var2)
print("Good bye!")
print("=============================================================")
# =============================================================
age = 20
print("")
if age <= 0:
    print("你是在逗我吧!")
elif age == 1:
    print("相当于 14 岁的人。")
elif age == 2:
    print("相当于 22 岁的人。")
elif age > 2:
    human = 22 + (age - 2) * 5
    print("对应人类年龄: ", human)
print("=============================================================")
# =============================================================
# 以下为if中常用的操作运算符:
# 操作符	描述
# <	    小于
# <=	小于或等于
# >	    大于
# >=	大于或等于
# ==	等于，比较两个值是否相等
# !=	不等于
print("=============================================================")
# =============================================================
